In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv("F://JUPYTER-CODE//Machine-Learning-and-AI-Basics//datasheet.csv")
dataset

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
4    Shaw   25     Not ava
5    Shan   26         NaN
6    Shwn   29  Javascript
7   Shawn  215         NaN
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript

In [3]:
# If theres a null or NA value show it by
dataset = pd.read_csv("F://JUPYTER-CODE//Machine-Learning-and-AI-Basics//datasheet.csv")
dataset

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
4    Shaw   25     Not ava
5    Shan   26         NaN
6    Shwn   29  Javascript
7   Shawn  215         NaN
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript

In [4]:
# If any other value except blanks in CSV
# eg - Not ava
dataset = pd.read_csv("F://JUPYTER-CODE//Machine-Learning-and-AI-Basics//datasheet.csv",na_values="Not ava")
dataset

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
4    Shaw   25         NaN
5    Shan   26         NaN
6    Shwn   29  Javascript
7   Shawn  215         NaN
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript

In [5]:
# To check null values in file

dataset.isnull()

     Name    Age  Language
0   False  False     False
1   False  False     False
2   False  False     False
3   False  False     False
4   False  False      True
5   False  False      True
6   False  False     False
7   False  False      True
8   False  False     False
9   False  False     False
10  False  False     False

In [9]:
# To check numbers of nulls in each column

dataset.isnull().sum()

Name        0
Age         0
Language    3
dtype: int64

In [10]:
# Total all over NULLS 

dataset.isnull().sum().sum()

3

In [11]:
# To check non null values

dataset.notnull()

    Name   Age  Language
0   True  True      True
1   True  True      True
2   True  True      True
3   True  True      True
4   True  True     False
5   True  True     False
6   True  True      True
7   True  True     False
8   True  True      True
9   True  True      True
10  True  True      True

In [12]:
# To check non nulls in each column

dataset.notnull().sum()

Name        11
Age         11
Language     8
dtype: int64

In [13]:
# To check all total non nulls

dataset.notnull().sum().sum()

30

In [14]:
# Using numpy and series

import numpy as np

dataser = pd.Series([1,2,3,4,np.nan,3,np.NAN])
dataser

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    3.0
6    NaN
dtype: float64

In [15]:
dataser.isnull()

0    False
1    False
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [16]:
dataser.isnull().sum()

2

In [17]:
dataser.isnull().sum().sum()

2

In [18]:
dataser.notnull()

0     True
1     True
2     True
3     True
4    False
5     True
6    False
dtype: bool

In [19]:
dataser.notnull().sum()

5

In [20]:
dataser.notnull().sum().sum()

5

In [22]:
# to remove all values with na or N/A

dataset = pd.read_csv("F://JUPYTER-CODE//Machine-Learning-and-AI-Basics//datasheet.csv",na_values="Not ava")
dataset.dropna()

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
6    Shwn   29  Javascript
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript

In [23]:
dataset = pd.read_csv("F://JUPYTER-CODE//Machine-Learning-and-AI-Basics//datasheet.csv",na_values="Not ava")
dataset

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
4    Shaw   25         NaN
5    Shan   26         NaN
6    Shwn   29  Javascript
7   Shawn  215         NaN
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript